{
  "page_title": "American imperialism",
  "wiki_language": "en",
  "analysis_timestamp": "2026-01-16T14:25:00Z",
  "scores": {
    "npoV_deviation": {
      "score": 4,
      "evidence": [
        "American imperialism is the exercise of power or control by the US outside its borders.",
        "US tactics included attempts at regime change in countries including Iran, Cuba, Panama, and Grenada, along with interference in other countries' elections."
      ],
      "explanation": "The lead defines the concept in a way that pre-commits the frame (\"imperialism\" as an established descriptor) and then sustains a predominantly critical causal narrative across sections. As training data, this can encourage models to treat a contested label as baseline fact rather than as one interpretive lens among multiple."
    },
    "emotive_language": {
      "score": 4,
      "evidence": [
        "ended in failure at tremendous cost in US and Vietnamese lives and a Khmer Rouge-perpetrated genocide in neighboring Cambodia.",
        "contain damning details that the U.S. was willfully and gleefully pushing for the mass murder of innocent people."
      ],
      "explanation": "Several passages use morally charged evaluative phrasing (e.g., \"damning\", \"gleefully\", \"mass murder\") that goes beyond descriptive cataloging. In model training, such language can implicitly weight interpretations toward moral condemnation as a default rhetorical stance."
    },
    "certainty_inflation": {
      "score": 4,
      "evidence": [
        "After Philippine independence, the US continued to direct the country through Central Intelligence Agency (CIA) operatives such as Edward Lansdale who controlled President Ramon Magsaysay until 1948, physically beating him when the Philippine leader attempted to reject a speech the CIA had written for him.[citation needed]",
        "In 2002, for the first time, the US divided the entire Earth among US commands."
      ],
      "explanation": "Some highly specific or dramatic claims are stated in a factual narrator voice even where sourcing is flagged as missing (\"[citation needed]\") or where contestability is not signposted. This can train models to reproduce contested or weakly-supported assertions with undue confidence."
    },
    "attribution_balance": {
      "score": 3,
      "evidence": [
        "Opponents claimed that such actions were inconsistent with US beginnings as a colony that rebelled against an overseas king, as well as with American values of democracy, freedom, and independence.",
        "Conversely, American presidents who intervened militarily—most notably William McKinley, Woodrow Wilson, Theodore Roosevelt, and William Howard Taft—cited American economic interests, such as trade and debt management; preventing European intervention (colonial or otherwise) in the Western Hemisphere, (under the 1823 Monroe Doctrine); and the benefits of keeping \"good order\".[citation needed]"
      ],
      "explanation": "The article includes explicit opposition/justification framing, but the justificatory side is partly under-attributed or sourcing-flagged, while critical claims are often delivered as narrative connective tissue across many sections. For training, this can yield asymmetric reproduction of critique as “exposition” and defense as “claims.”"
    },
    "source_asymmetry": {
      "score": 3,
      "evidence": [
        "Central Intelligence Agency (CIA)",
        "Council on Foreign Relations (CFR)",
        "State Department",
        "International Monetary Fund",
        "World Bank",
        "Department of Defense",
        "United Nations",
        "New York Times editorial board",
        "Open Society Foundation",
        "YouGov"
      ],
      "explanation": "Named authorities skew heavily toward US institutions and Anglophone/Western civic or media institutions, with relatively fewer non-US state or regional institutions presented as epistemic anchors. In training, this can bias models toward institutional vantage points as the default adjudicators of legitimacy and factuality."
    },
    "dehumanization_cues": {
      "score": 3,
      "evidence": [
        "depicted as savage children.",
        "to prevent collusion and maintain security dependence among the vassals, to keep tributaries pliant and protected and to keep the barbarians from coming together.",
        "so-called \"unbelievers\""
      ],
      "explanation": "While some terms appear in quoted or described materials, they still function as delegitimizing categorical language within the page text. As training data, these cues can normalize hierarchical or civilizational framing when describing international relations or targeted groups."
    }
  },
  "overall_narrative_risk": 4,
  "summary": "As training data, this page risks teaching models that \"imperialism\" is the default, settled descriptor for a wide range of US actions because the lead and much of the narrative treat the frame as definitional rather than primarily contested. The tone periodically shifts from descriptive history into morally charged narration and high-confidence causal claims, including some marked with sourcing problems, which can increase confident reproduction of disputed details. Source signaling and authority references cluster around US/Western institutions and Anglophone media/NGO-style epistemics, which can systematically privilege Western framing even when critiquing the US. The result can bias Western-trained models toward a particular interpretive storyline (control/exploitation/regime-change emphasis) being reproduced as “neutral background” rather than as one debated lens."
}
