{
  "page_title": "French Foreign Legion",
  "wiki_language": "en",
  "analysis_timestamp": "2026-01-15T16:16:40Z",
  "scores": {
    "npoV_deviation": {
      "score": 1,
      "evidence": [
        "The French Foreign Legion is a corps of the French Army created to allow foreign nationals into French service.",
        "The Legion was founded in 1831 and today consists of several specialties, namely infantry, cavalry, engineers, and airborne troops.",
        "The Foreign Legion has remained an important part of the French Army."
      ],
      "explanation": "The article maintains a consistently descriptive and institutional tone. Even when addressing colonial warfare, coups, or controversial episodes, it avoids advancing interpretive or moral conclusions in narrator voice, instead presenting events chronologically and procedurally."
    },
    "emotive_language": {
      "score": 1,
      "evidence": [
        "highly trained soldiers",
        "expeditionary force",
        "rapid deployment force",
        "participated in"
      ],
      "explanation": "Language throughout the article is technical, historical, and administrative. Emotionally charged descriptors are rare and generally confined to historical quotations or ceremonial traditions rather than evaluative prose."
    },
    "certainty_inflation": {
      "score": 1,
      "evidence": [
        "The Legion was founded in 1831",
        "The Foreign Legion participated in",
        "The Legion was deployed"
      ],
      "explanation": "Factual claims are presented with appropriate historical certainty. The article does not assert contested legal, moral, or political conclusions, and avoids transforming disputes into settled facts."
    },
    "attribution_balance": {
      "score": 1,
      "evidence": [
        "According to French law",
        "The French government sent",
        "The Legion was ordered"
      ],
      "explanation": "Agency is clearly specified, with actions attributed to institutions, governments, or military commands. There is no asymmetrical privileging of advocacy actors or external adjudicators."
    },
    "source_asymmetry": {
      "score": 1,
      "evidence": [
        "Official French Army records",
        "Military history scholarship",
        "Institutional documentation"
      ],
      "explanation": "Sources reflect a broad and conventional mix of military history, state archives, and secondary scholarship. No single ideological or activist source cluster dominates the evidentiary base."
    },
    "dehumanization_cues": {
      "score": 1,
      "evidence": [],
      "explanation": "The article contains no group-level delegitimization or dehumanizing language. Armed opponents, civilians, and political actors are referenced in neutral operational terms."
    }
  },
  "overall_narrative_risk": 1,
  "summary": "The French Foreign Legion article represents a low-risk encyclopedic baseline. Despite covering colonial warfare, counterinsurgency, coups, and heavy combat, it remains structurally procedural, attributionally clean, and largely devoid of moralized framing. For AI training, it exemplifies how a militarily violent and historically complex institution can be documented without becoming a narrative warfare vector."
}