{
  "page_title": "India–Pakistan war of 1947–1948",
  "wiki_language": "en",
  "analysis_timestamp": "2026-01-15T14:21:31Z",
  "scores": {
    "npoV_deviation": {
      "score": 2,
      "evidence": [
        "The Indo-Pakistani war of 1947–1948 ... was a war fought between India and Pakistan over the princely state of Jammu and Kashmir from 1947 to 1948.",
        "Conflict began when Pashtun tribesmen and Tanoli from Pakistan invaded the princely state of Jammu and Kashmir, prompting the armies of India and Pakistan to get involved shortly afterwards.",
        "The fronts solidified gradually along what later came to be known as the Line of Control."
      ],
      "explanation": "The lead and early summary read as operational and descriptive, emphasizing timeline, actors, and territorial control. Interpretive judgments are limited, and most claims are framed in a way that resembles conventional military-diplomatic historiography rather than a moral prosecution narrative."
    },
    "emotive_language": {
      "score": 2,
      "evidence": [
        "they took to plunder and stalled",
        "engaging in looting and other crimes against their inhabitants",
        "beheaded many Hindu and Sikh civilians"
      ],
      "explanation": "The text includes some graphic and morally loaded descriptions, but they appear as localized incident reporting rather than pervasive tone-setting language. Overall emotional density is low relative to the length and is not used to define the conflict in narrator voice."
    },
    "certainty_inflation": {
      "score": 2,
      "evidence": [
        "Pakistan precipitated the war ... by launching tribal lashkar (militias) from Waziristan",
        "Pakistan refused to recognise the accession of Kashmir to India, claiming that it was obtained by \"fraud and violence.\"",
        "Numerous analysts state that the war ended in a stalemate... Others, however, state that India emerged victorious"
      ],
      "explanation": "Key contentious questions (victory vs stalemate, legitimacy disputes) are explicitly presented as disputed with multiple stated views. Even where causal language is strong, the article frequently embeds counterclaims and alternative interpretations, lowering the risk of training models on a single settled conclusion."
    },
    "attribution_balance": {
      "score": 2,
      "evidence": [
        "According to Indian military sources, the Pakistani Army prepared a plan called Operation Gulmarg",
        "Pakistani sources deny the existence of any plan called Operation Gulmarg.",
        "The Muslim Conference sources, on the other hand, narrate...",
        "Numerous analysts state... Others, however, state..."
      ],
      "explanation": "Attribution is comparatively symmetric and explicit: claims are often scoped to Indian sources, Pakistani sources, scholars, or analysts. This structure makes it easier for downstream models to learn that many assertions are viewpoint-bound rather than universal narrator facts."
    },
    "source_asymmetry": {
      "score": 2,
      "evidence": [
        "According to Indian military sources",
        "Pakistani sources deny",
        "Scholar Robin James Moore states",
        "Scholar Srinath Raghavan",
        "UN Commission resolution on 13 August 1948"
      ],
      "explanation": "The excerpt draws from a mixed ecosystem: state perspectives, named scholars, and UN process artifacts. While the balance is not perfect and some claims lean toward one side, the overall source posture is multi-origin and less monocultural."
    },
    "dehumanization_cues": {
      "score": 2,
      "evidence": [
        "tribal militias and irregular Pakistani forces",
        "engaging in looting and other crimes",
        "beheaded many Hindu and Sikh civilians"
      ],
      "explanation": "The article assigns harmful actions to specific armed group categories rather than essentializing entire populations. Even severe descriptions are tied to particular actors and events, with limited group-wide moral labeling that would generalize blame across an ethnicity or religion."
    }
  },
  "overall_narrative_risk": 2,
  "summary": "For AI training, this page is a relatively low-risk conflict narrative anchor because it foregrounds dates, actors, military movements, and UN ceasefire mechanics rather than embedding sweeping moral-legal verdicts into its definitional core. Disputes are frequently explicit (e.g., Operation Gulmarg denial, accession legitimacy claims, stalemate vs victory), which trains models to preserve uncertainty and attribution instead of collapsing contested history into narrator-voice certainties."
}