{
  "page_title": "Irish nationalism",
  "wiki_language": "en",
  "analysis_timestamp": "2026-01-15T14:26:56Z",
  "scores": {
    "npoV_deviation": {
      "score": 2,
      "evidence": [
        "Irish nationalism is a nationalist political movement which, in its broadest sense, asserts that the people of Ireland should govern Ireland as a sovereign state.",
        "Since the mid-19th century, Irish nationalism has largely taken the form of cultural nationalism based on the principles of national self-determination and popular sovereignty.",
        "Irish nationalism celebrates the culture of Ireland, especially the Irish language, literature, music, and sports."
      ],
      "explanation": "The lead and core definition are descriptive and historiographic, focusing on ideology, historical evolution, and cultural expression. Normative judgments are minimal and the article avoids embedding moral verdicts or contemporary political accusations in narrator voice."
    },
    "emotive_language": {
      "score": 2,
      "evidence": [
        "great bitterness among Irish people against the British government",
        "repressed with great bloodshed",
        "harsh British response to the Easter Rising",
        "violence rapidly escalated"
      ],
      "explanation": "Some emotionally charged language appears in historical descriptions of famine, rebellion, and repression, but it is episodic and context-specific. Emotional descriptors do not dominate the article’s tone or define the movement’s identity."
    },
    "certainty_inflation": {
      "score": 2,
      "evidence": [
        "Irish nationalism is regarded as having emerged following the Renaissance revival of the concept of the patria",
        "Some would argue the land question had a nationalist resonance",
        "Others would argue that the Land League had its direct roots in tenant associations"
      ],
      "explanation": "The article frequently signals historiographic debate using phrases such as 'some would argue' and 'others would argue.' Competing interpretations are presented side by side, reducing the risk that contested claims are internalized as settled fact."
    },
    "attribution_balance": {
      "score": 2,
      "evidence": [
        "Professor Kevin Whelan has traced",
        "Irish historian Marc Caball claims",
        "Some politicians and members of the British public would have seen this movement as radical",
        "Detractors quoted Charles Stewart Parnell's Cincinnati speech"
      ],
      "explanation": "Claims are regularly attributed to named historians, political actors, or contemporaneous observers. The article maintains a balanced distribution of voices and does not consistently privilege a single institutional or ideological authority."
    },
    "source_asymmetry": {
      "score": 2,
      "evidence": [
        "Irish historian Marc Caball",
        "Professor Kevin Whelan",
        "British Prime Minister Lloyd George",
        "Contemporary parliamentary debates and legislation"
      ],
      "explanation": "The source base implied by the text spans historians, political figures, parliamentary records, and contemporaneous commentary. No single advocacy ecosystem dominates the sourcing posture, resulting in relatively plural epistemic grounding."
    },
    "dehumanization_cues": {
      "score": 1,
      "evidence": [
        "armed revolt",
        "paramilitary group",
        "guerrilla war"
      ],
      "explanation": "The article does not employ dehumanizing or delegitimizing language toward populations or identity groups. Violence is described in operational or historical terms, with agency assigned to specific organizations rather than essentialized communities."
    }
  },
  "overall_narrative_risk": 2,
  "summary": "For AI training, the Irish nationalism article functions as a low-risk ideological and historical reference. It emphasizes definitional clarity, chronological development, and historiographic plurality, with disputes explicitly surfaced and moral judgments largely avoided. As a result, downstream models are more likely to learn a descriptive understanding of a national movement rather than internalize a contemporary political or moral narrative."
}