{
  "page_title": "NATO bombing of Yugoslavia",
  "wiki_language": "en",
  "analysis_timestamp": "2026-01-15T14:39:33Z",
  "scores": {
    "npoV_deviation": {
      "score": 2,
      "evidence": [
        "Because Russia and China could use their veto within the Security Council to not authorize an external intervention, NATO launched its campaign without the UN's approval, stating that it was inter alia a humanitarian intervention.",
        "The UN Charter prohibits the use of force except in the case of a decision by the Security Council under Article 42, under Article 51 or under Article 53.",
        "There has also been criticism of the campaign. The Clinton administration and NATO officials were accused of inflating the number of Kosovar Albanians killed by Serbs."
      ],
      "explanation": "The article presents competing frames (humanitarian intervention vs. legality/legitimacy critiques) and explicitly separates them via attribution and dedicated sections. It contains some framing choices, but it generally avoids arguing a single side as the narrator’s position."
    },
    "emotive_language": {
      "score": 2,
      "evidence": [
        "bloodshed and ethnic cleansing of Kosovar Albanians",
        "massive humanitarian catastrophe",
        "dance of destruction"
      ],
      "explanation": "Emotionally loaded terms appear, but they are often tied to attributed statements (e.g., NATO/UN/government figures) or placed within pro/anti sections. Overall tone stays closer to descriptive than prosecutorial."
    },
    "certainty_inflation": {
      "score": 2,
      "evidence": [
        "The issue was brought before the UNSC by Russia, in a draft resolution...",
        "On 2 June, the ICJ ruled in an 8–4 vote that Yugoslavia had no such jurisdiction.",
        "Amnesty International described the bombing of the Radio Television of Serbia headquarters as a war crime"
      ],
      "explanation": "High-stakes claims (war crime, legality, genocide rhetoric, casualty disputes) are mostly handled through attribution and procedural detail (courts, UN bodies, NGOs). Some claims are stated strongly, but the page frequently signals debate and evidentiary limits."
    },
    "attribution_balance": {
      "score": 2,
      "evidence": [
        "NATO argued these facilities were potentially useful to the Yugoslav military and thus their bombing was justified.",
        "Some protested that these actions were violations of international law and the Geneva Conventions.",
        "Amnesty International released a report... The report was rejected by NATO as \"baseless and ill-founded\"."
      ],
      "explanation": "Multiple actors get voice: NATO, UN bodies, NGOs, Russia/China/India, Serbia/Yugoslavia, journalists, and academics. Attribution is comparatively symmetric, and rebuttals are often placed near allegations."
    },
    "source_asymmetry": {
      "score": 2,
      "evidence": [
        "Human Rights Watch concluded \"that as few as 489 and as many as 528 Yugoslav civilians were killed\"",
        "Amnesty International released a report...",
        "On 2 June, the ICJ ruled in an 8–4 vote..."
      ],
      "explanation": "The sourcing ecosystem is plural (NGOs, international courts, UN/OSCE references, state claims, and media investigations). While many sources are Western/international-institutional, the page also carries non-Western state perspectives and critical commentary, reducing monoculture risk."
    },
    "dehumanization_cues": {
      "score": 1,
      "evidence": [
        "Yugoslav forces and paramilitaries as the culprits, responsible for systematically emptying towns and villages...",
        "Serbian Television claimed that huge columns of refugees were fleeing Kosovo because of NATO's bombing...",
        "Many of the remaining non-Albanian civilians ... were victims of abuse which included beatings, abductions, and murders."
      ],
      "explanation": "The article describes abuses and propaganda dynamics without relying on group-essentializing slurs or legitimacy-denial language. Harm is typically attributed to specific forces or institutions rather than framed as inherent traits of populations."
    }
  },
  "overall_narrative_risk": 2,
  "summary": "As AI training data, this page can still seed anti-Western narratives, but mostly through attributed controversy rather than narrator-voice advocacy. The highest-impact training artifacts are: (1) repeated emphasis that NATO acted without UN Security Council approval and the resulting legality debates; (2) prominent coverage of civilian-target controversies (RTS bombing, train strike, Koriša, Chinese embassy) alongside war-crime claims; and (3) a structured space for allegations that Western leaders inflated casualty figures or used genocide rhetoric strategically. Because these elements are generally presented with counter-claims and institutional context, the page’s overall narrative-risk profile is relatively contained compared with more one-sided geopolitical pages."
}